app/Controllers/Admin.php

SELECT *
FROM `tbl_payment`
ORDER BY `payment_id` DESC
---
    public function index()
    {
        $session = session();
        $logged_in = $session->get('logged_in');
        if (!$logged_in) {
            return redirect()->to('/');
        }

        $model = new PaymentModel();
        $data = $model->orderby('payment_id', 'DESC')->findall();

SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function auth()
    {
        $submit = $this->request->getVar('submit');
        if ($submit == "cancel") {
            return redirect()->to('/');
        } else {
            helper(['form']);
            $rules = [
                'username' => 'required',
                'password' => 'required'
            ];

            if ($this->validate($rules)) {
                $session = session();
                $model = new UserModel();
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');
                $data = $model->where('username', $username)->first();

SELECT *
FROM `tbl_payment`
WHERE `payment_status` = 'Not Yet Paid'
---
    public function verification()
    {
        $session = session();
        $model = new PaymentModel();

        //Info Ottopay
        $APIkey = "14OIOYA1490AA034339O03A0K9Y0PI01";
        $MerchantID = base64_encode("OP1E00030948");
        $timestamp = strtotime(date('Y-m-d H:i:s'));

        $logged_in = $session->get('logged_in');
        if (!$logged_in) {
            return redirect()->to('/');
        } else {
            $data = $model->where('payment_status', 'Not Yet Paid')->findall();

UPDATE `tbl_payment` SET `payment_status` = 'Success', `date_modified` = '2023-03-25 05:28:56'
WHERE `payment_id` = '16'
---
                            $model->set('payment_status', 'Success');
                            $model->set('date_modified', date('Y-m-d H:i:s'));
                            $model->where('payment_id', $pay['payment_id']);
                            $model->update();

UPDATE `tbl_payment` SET `payment_status` = 'Transaction Fail', `date_modified` = '2023-03-25 08:17:42'
WHERE `payment_id` = '17'
---
                            $model->set('payment_status', 'Transaction Fail');
                            $model->set('date_modified', date('Y-m-d H:i:s'));
                            $model->where('payment_id', $pay['payment_id']);
                            $model->update();