app/Controllers/Home.php

    public function rekappage($payment_id)
    {
        $session = session();
        $model = new PaymentModel();
        $payment = $model->where('payment_id', $payment_id)->first();
---
SELECT *
FROM `tbl_payment`
WHERE `payment_id` = '17'
 LIMIT 1

    public function dopayment($id)
    {
        $model = new PaymentModel();
        $payment = $model->where('payment_id', $id)->first();
---
SELECT *
FROM `tbl_payment`
WHERE `payment_id` = '16'
 LIMIT 1